---
kind: method
id: M:Autodesk.Revit.DB.ViewNavigationToolSettings.IsHomeCameraSet
source: html/0aed2fda-abf9-eb16-7832-1e211cd13a0f.htm
---
# Autodesk.Revit.DB.ViewNavigationToolSettings.IsHomeCameraSet Method

Checks if the home view is set in the settings.

## Syntax (C#)
```csharp
public bool IsHomeCameraSet()
```

## Returns
Returns true if home view is set, otherwise false.